Data/Final_Implemented_data/Request/Request round/TEXT/test_round3.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient).....done


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /
Document Length:        714 bytes

Concurrency Level:      10
Time taken for tests:   3.140 seconds
Complete requests:      100
Failed requests:        20
   (Connect: 0, Receive: 0, Length: 20, Exceptions: 0)
Total transferred:      88520 bytes
HTML transferred:       73020 bytes
Requests per second:    31.84 [#/sec] (mean)
Time per request:       314.045 [ms] (mean)
Time per request:       31.405 [ms] (mean, across all concurrent requests)
Transfer rate:          27.53 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      104  248  51.4    255     333
Processing:     1   45  67.9      4     197
Waiting:        1   42  63.7      3     197
Total:        122  293  78.3    289     476

Percentage of the requests served within a certain time (ms)
  50%    289
  66%    310
  75%    329
  80%    336
  90%    428
  95%    448
  98%    459
  99%    476
 100%    476 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient)


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /
Document Length:        954 bytes

Concurrency Level:      10
Time taken for tests:   14.132 seconds
Complete requests:      200
Failed requests:        7
   (Connect: 0, Receive: 0, Length: 7, Exceptions: 0)
Total transferred:      222527 bytes
HTML transferred:       191520 bytes
Requests per second:    14.15 [#/sec] (mean)
Time per request:       706.617 [ms] (mean)
Time per request:       70.662 [ms] (mean, across all concurrent requests)
Transfer rate:          15.38 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       42  569 183.1    585     954
Processing:     2  130 174.7      6     636
Waiting:        1  123 167.6      6     635
Total:         58  699 266.1    683    1380

Percentage of the requests served within a certain time (ms)
  50%    683
  66%    736
  75%    833
  80%    932
  90%   1077
  95%   1233
  98%   1312
  99%   1360
 100%   1380 (longest request)


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /
Document Length:        954 bytes

Concurrency Level:      10
Time taken for tests:   21.268 seconds
Complete requests:      300
Failed requests:        200
   (Connect: 0, Receive: 0, Length: 200, Exceptions: 0)
Total transferred:      381140 bytes
HTML transferred:       334440 bytes
Requests per second:    14.11 [#/sec] (mean)
Time per request:       708.929 [ms] (mean)
Time per request:       70.893 [ms] (mean, across all concurrent requests)
Transfer rate:          17.50 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      233  550 175.8    520     978
Processing:     2  127 146.8     10     485
Waiting:        1  120 139.0     10     485
Total:        258  677 201.6    680    1184

Percentage of the requests served within a certain time (ms)
  50%    680
  66%    763
  75%    804
  80%    838
  90%    954
  95%   1057
  98%   1122
  99%   1157
 100%   1184 (longest request)